["ประกาศการจัดห้องเรียนและกำหนดเลขประจำตัวนักเรียน ชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567","ประกาศการจัดห้องเรียนและกำหนดเลขประจำตัวนักเรียน ชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567","ประกาศเรียกนักเรียนที่ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2567 บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ บัญชีสำรอง มารายงานตัวและมอบตัว ครั้งที่ 3","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ บัญชีสำรอง มารายงานตัวและมอบตัว ครั้งที่ 3","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2567 บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ บัญชีสำรอง มารายงานตัวและมอบตัว ครั้งที่ 2","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ บัญชีสำรอง มารายงานตัวและมอบตัว ครั้งที่ 2","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 และชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ บัญชีสำรอง มารายงานตัวและมอบตัว ครั้งที่ 1","ประกาศเรียกนักเรียนที่ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2567 บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศผลการสอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนปกติ","ประกาศผลการสอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1  ปีการศึกษา 2567 ประเภทห้องเรียนปกติ","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศผลการสอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1  ห้องเรียนปกติ ปีการศึกษา 2567 ประเภทนักเรียนความสามารถพิเศษ","ประกาศโรงเรียนระยองวิทยาคม เรื่อง รายชื่อผู้มีสิทธิ์สอบเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทห้องเรียนปกติ ปีการศึกษา 2567","ประกาศโรงเรียนระยองวิทยาคม เรื่อง รายชื่อผู้มีสิทธิ์สอบเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 1 ประเภทห้องเรียนปกติ ปีการศึกษา 2567","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศโรงเรียนระยองวิทยาคม เรื่อง รายชื่อผู้มีสิทธิ์สอบเข้าศึกษาต่อระดับชั้นมัธยมศึกษาปีที่ 1 ประเภทห้องเรียนปกติ นักเรียนที่มีความสามารถพิเศษ ปีการศึกษา 2567","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทนักเรียนที่มีศักยภาพเหมาะสม บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศผลการสอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ","ประกาศการรับสมัครนักเรียนเข้าเรียน ประเภทห้องเรียนปกติ ปีการศึกษา 2567","ประกาศผลการสอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2567 ประเภทห้องเรียนพิเศษ","ตารางสอบปลายภาค ภาคเรียนที่ 2 ปีการศึกษา 2566","ประกาศโรงเรียนระยองวิทยาคม เรื่อง รายชื่อผู้มีสิทธิ์สอบเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทห้องเรียนพิเศษ ปีการศึกษา 2567","ประกาศโรงเรียนระยองวิทยาคม เรื่อง รายชื่อผู้มีสิทธิ์สอบเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 1 ประเภทห้องเรียนพิเศษ                       ปีการศึกษา 2567","ประกาศโรงเรียนระยองวิทยาคม เรื่อง การรับนักเรียนเข้าเรียนชั้นมัธยมศึกษาปีที่ 4 ประเภทห้องเรียนพิเศษ ปีการศึกษา 2567","ประกาศโรงเรียนระยองวิทยาคม เรื่อง การรับนักเรียนเข้าเรียนชั้นมัธยมศึกษาปีที่ 1 ประเภทห้องเรียนพิเศษ ปีการศึกษา 2567","ประกาศรายชื่อนักเรียนชั้นมัธยมศึกษาปีที่ 3 ผู้ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม และบัญชีสำรอง ปีการศึกษา 2567","ประกาศ เรื่อง แจ้งหยุดทำการเรียนการสอน ภาคเรียนที่ 2 ปีการศึกษา 2566","ประกาศรายชื่อนักเรียนชั้นมัธยมศึกษาปีที่ 3 ที่สมัครเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (ด้านศักยภาพ) ปีการศึกษา 2567","ประกาศการรับสมัครนักเรียนชั้นมัธยมศึกษาปีที่ 3 ที่สมัครเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (ด้านศักยภาพ) ปีการศึกษา 2567","ประกาศรายชื่อนักเรียนชั้นมัธยมศึกษาปีที่ 3 ผู้ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (ด้านคุณธรรมและด้านวิชาการ) ปีการศึกษา 2567","ประกาศรายชื่อนักเรียนชั้นมัธยมศึกษาปีที่ 3 ที่สมัครเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม ปีการศึกษา 2567","ตารางสอบกลางภาค ภาคเรียนที่ 2 ปีการศึกษา 2566","ประกาศแจ้งหยุดเรียนและเรียนออนไลน์ชดเชย","ประกาศการส่งเสริมและสนับสนุนนักเรียนให้พร้อมสำหรับการทดสอบวัดความถนัด (TGAT และ TPAT)","รายชื่อนักเรียน วิชาเพิ่มเติม ระดับชั้น ม.2 และ ม.3 ภาคเรียนที่ 2 ปีการศึกษา 2566","ตารางสอบปลายภาค ภาคเรียนที่ 1 ปีการศึกษา 2566","ประกาศห้องสอบ ASMO 2023","ช่องทางอิเล็กทรอนิกส์สำหรับติดต่อโรงเรียนระยองวิทยาคม พ.ศ. 2566","ประกาศโรงเรียนระยองวิทยาคม เรื่อง การจัดการเรียนการสอนออนไลน์","ตารางสอบกลางภาค ภาคเรียนที่ 1 ปีการศึกษา 2566","รายชื่อนักเรียน กิจกรรมชุมนุม ชั้น ม.6","รายชื่อนักเรียน กิจกรรมชุมนุม ชั้น ม.5","รายชื่อนักเรียน กิจกรรมชุมนุม ชั้น ม.4","รายชื่อนักเรียน กิจกรรมชุมนุม ชั้น ม.3","รายชื่อนักเรียน กิจกรรมชุมนุม ชั้น ม.2","ประกาศรายวิชาเพิ่มเติม นักเรียนชั้น ม.2 และ ม.3 ปีการศึกษา 2566","ประกาศการจัดห้องเรียนและกำหนดเลขประจำตัวนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2566","ประกาศการจัดห้องเรียนและกำหนดเลขประจำตัวนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2566","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2566 ประเภทห้องเรียนพิเศษ English Program แผนการเรียนศิลป์ภาษา บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ห้องเรียนปกติ ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนชั้นมัธยมศึกษาปีที่ 3 ผู้ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2566 ประเภทห้องเรียนพิเศษ English Program แผนการเรียนศิลป์ภาษา บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ห้องเรียนปกติ ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนชั้นมัธยมศึกษาปีที่ 3 ผู้ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2566 ประเภทห้องเรียนพิเศษ บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ห้องเรียนปกติ ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนชั้นมัธยมศึกษาปีที่ 3 ผู้ได้รับการคัดเลือกเข้าศึกษาต่อชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ห้องเรียนปกติ ปีการศึกษา 2566 บัญชีสำรอง รายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ปีการศึกษา 2566 ประเภทห้องเรียนพิเศษนิติศาสตร์ – รัฐศาสตร์ บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2566 ประเภทห้องเรียนพิเศษ Smart Com บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 และชั้นมัธยมศึกษาปีที่ 4 ประเภทห้องเรียนพิเศษ ปีการศึกษา 2566 บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 4 ห้องเรียนปกติ ปีการศึกษา 2566 บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนชั้นมัธยมศึกษาปีที่ 3 ผู้ได้รับการคัดเลือกเข้าศึกษาต่อนักชั้นมัธยมศึกษาปีที่ 4 ประเภทนักเรียนที่มีศักยภาพเหมาะสม (โควตา) ปีการศึกษา 2566 บัญชีสำรอง มารายงานตัวและมอบตัว","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ห้องเรียนปกติ ปีการศึกษา 2566 บัญชีสำรอง มารายงานตัวและมอบตัว","Open Chat นักเรียนที่มีความประสงค์สมัครเข้ารับการทดสอบ นศท.ปี 2566","ประกาศเรียกนักเรียนที่สอบคัดเลือกนักเรียนชั้นมัธยมศึกษาปีที่ 1 ปีการศึกษา 2566 ประเภทห้องเรียนพิเศษ โครงการจัดการเรียนการสอนตามหลักสูตรกระทรวงศึกษาธิการเป็นภาษาอังกฤษ English Program บัญชีสำรอง มารายงานตัวและมอบตัว"]